** Operator Precedence
 |------------+---------------+---------------------------+---------------|
 | Precedence | Operator      | Description               | Associativity |
 |------------+---------------+---------------------------+---------------|
 |          1 | ::            | Scope resolution          | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          2 | a++, a--      | Postfix inc/dec           | Left-to-right |
 |            | type()        | Functional cast           |               |
 |            | a()           | Functional call           |               |
 |            | a[]           | Subscript                 |               |
 |            | . ->          | Member access             |               |
 |------------+---------------+---------------------------+---------------|
 |          3 | ++a, --a      | Prefix inc/dec            | Right-to-left |
 |            | +a, -a        | Unary plus/minus          |               |
 |            | ! ~           | Logical Not, Bitwise Not  |               |
 |            | (type)        | C-style cast              |               |
 |            | *a            | Dereference               |               |
 |            | &a            | Address-of                |               |
 |            | sizeof        | Size-of                   |               |
 |            | new           | Dynamic memory allocation |               |
 |            | delete        | Dynamic memory allocation |               |
 |------------+---------------+---------------------------+---------------|
 |          4 | .*, ->*       | Pointer-to-member         | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          5 | a*b, a/b, a%b | Mul, Div, Modul           | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          6 | a+b, a-b      | Add, Sub                  | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          7 | <<, >>        | Bitwise left shift, right | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          8 | <=>           | Three-way comparison      | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |          9 | < <=          | Relation operators        | Left-to-right |
 |            | > >=          | Relation operators        | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         10 | == !=         | Relation operators        | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         11 | a&b           | Bitwise and               | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         12 | a^b           | Bitwise xor               | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         13 | a OR b        | Bitwise or                | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         14 | &&            | Logical and               | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         15 |               | Logical or                | Left-to-right |
 |------------+---------------+---------------------------+---------------|
 |         16 | a?b:c         | Ternary operator          | Right-to-left |
 |            | throw         |                           |               |
 |            | =             |                           |               |
 |            | +=, -=        |                           |               |
 |            | *=, /=, %=    |                           |               |
 |            | <<=, >>=      |                           |               |
 |            | &=, ^=,       |                           |               |
 |------------+---------------+---------------------------+---------------|
 |         17 | ,             | Comma Operator            | Left-to-right |

 Example bit operator

 #+begin_src cpp :includes <iostream>
 std::cout << "4 & 2   << 1: " << (4 & 2 << 1) << std::endl;
 std::cout << "(4 & 2) << 1: " << ((4 & 2) << 1) << std::endl;
 #+end_src

 #+RESULTS:
 |  4 | & |  2 | << | 1: | 4 |
 | (4 | & | 2) | << | 1: | 0 |

*** Name lookup
  + Unqualified name lookup
    
    For an unqualified name, that is a name that does not appear to
    the right of a scope resolution operator ::, name lookup examines
    the scopes as described below, until it finds at least one
    declaration of any kind, at which time the lookup stops and no
    further scopes are examined.
    
    See [[http://en.cppreference.com/w/cpp/language/unqualified_lookup][Link]]
  + Qualified name lookup
    
    A qualified name is a name that appears on the right hand side of
    the scope resolution operator :: (see also qualified identifiers).
  + Arguement dependent lookup 

    If you supply a function argument of class type, then to find the
    function name the compiler considers matching names in the
    namespace containing the argument's type.

    #+begin_src cpp :includes <iostream>
      namespace A { // Begin of namespace A

      struct B {}; 

      void foo(B x) {
          std::cout <<"foo(A)" << std::endl;
      }
      } // End of namespace A

      int main() {
          foo(A::B()); // ADL rule applies
      }

    #+end_src 
    
    Example where ADL leads to unexpected behaviour.
    
    #+begin_src cpp :includes <iostream>
      namespace A { // Begin of namespace A
      namespace B { // Begin of namespace B

      struct C {};

      void foo(C x) {std::cout << "A::B::C::foo()" << std::endl;} // Is called
      } // End of namespace B
      using B::C;
      void foo(C x) {std::cout << "A::C::foo()" << std::endl;} // Is not called

      } // End of namespace A

      int main() {
          A::C c;
          foo(c); // ADL only searches in the namespace in which the type was defined
      }

    #+end_src 

    #+RESULTS:
    : A::B::C::foo()

*** Template Arguement Deduction
    + Dropping const when function template takes parameter by value
      
      #+begin_src cpp
        template <typename T>
        void foo(T t) { t*=2; }; // const ist dropped

        template <typename T>
        void bar(const T t) {t*=2;}; 

        int main() {
            const int i = 0;
            foo(i);
            bar(i); // Does not compile
        }


      #+end_src

      #+RESULTS:

    + Template arguement deduction does not convert
      
      #+begin_src cpp 
        #include <iostream>
        #include <functional>
        template<typename T>
        void foo(T val, std::function<void (T)> f) {
            f(val);
        }

        // Identity template meta function
        template <typename T>
        struct Identity 
        {
            using type = T;
        };

        template <typename T>
        void bar(T val, typename Identity<std::function<void (T)>>::type f) {
            f(val);
        }

        int main() {
            std::function<void (int)> fxn = [] (int x) { std::cout << x << std::endl;};
            // foo(1234, [](int x) { std::cout << x << std::endl;}); Fails to compile
            foo(1234, fxn); // Ok because no conversion takes place
            bar(1234, [] (int x) { std::cout << x << std::endl;}); // Ok because type is deduced in Idenity metafunc and then converted
        }
      #+end_src

      #+RESULTS:
      | 1234 |
      | 1234 |

    + When template argument deduction fail, function is not added to
      overload resolution set
      
